run-SNOWPACKFoam/BYL-tundra-2014-2015-noHet-drift/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);
boundaryField
{
    top
    {
        //type            zeroGradient;        		
        
        /*
        type            fixedValue;
        value           uniform (0 0 0);
        */
        
        type            slip;

        //type            noSlip;
    }

    bottom
    {
        //type            zeroGradient;        		
        
        /*
        type            fixedValue;
        value           uniform (0 0 0);
        */
        
        type            slip;

        //type            noSlip;
    }

    left
    {
        type            cyclic; 
        //type            slip;                
    }

    right
    {
        type            cyclic;                
        //type            slip;                
    }

    frontAndBack
    {
        type empty;
    } 
}

// ************************************************************************* //
